IDEA StatiCa Open Model
OpenModelResult.SaveToXmlFile Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Saves content into file as a XML format
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool SaveToXmlFile(
	string xmlFileName
)
Public Function SaveToXmlFile (
	xmlFileName As String
) As Boolean
public:
bool SaveToXmlFile(
	String^ xmlFileName
)
Parameters
xmlFileName
Type: System.String
XML file name
Return Value
Type: Boolean
True if succeeded
See Also
Reference
OpenModelResult Class
IdeaRS.OpenModel.Result Namespace